dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/AESADV_1.0.xml
        </group>
    <group id="AESADV_INT_EVENT2" name="AESADV_INT_EVENT2" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="AESADV_INT_EVENT2_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="TRIG1" value="0x1" description="AES DMA Trigger 1 (Data Output trigger)"/>
            </bitfield>
        </register>
        <register id="AESADV_INT_EVENT2_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TRIG1" description="TRIG1 event mask." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="AESADV_INT_EVENT2_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TRIG1" description="TRIG1 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AESADV_INT_EVENT2_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TRIG1" description="TRIG1 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AESADV_INT_EVENT2_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TRIG1" description="TRIG1 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="AESADV_INT_EVENT2_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="TRIG1" description="TRIG1 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
        </group>
    <register id="AESADV_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="AESADV_GCMCCM_TAG0" width="32" offset="0x1100" description="CBC-MAC third key (LSW) / GCM &amp; CCM Intermediate TAG (LSW)">
    </register>
    <register id="AESADV_GCMCCM_TAG1" width="32" offset="0x1104" description="CBC-MAC third key / GCM &amp; CCM Intermediate TAG">
    </register>
    <register id="AESADV_GCMCCM_TAG2" width="32" offset="0x1108" description="CBC-MAC third key / GCM &amp; CCM Intermediate TAG">
    </register>
    <register id="AESADV_GCMCCM_TAG3" width="32" offset="0x110C" description="CBC-MAC third key (MSW) / GCM &amp; CCM Intermediate TAG (MSW)">
    </register>
    <register id="AESADV_GHASH_H0" width="32" offset="0x1110" description="CCM &amp; CBC-MAC second key (LSW) / GCM Hash Key input (LSW)">
    </register>
    <register id="AESADV_GHASH_H1" width="32" offset="0x1114" description="CCM &amp; CBC-MAC second key  / GCM Hash Key input">
    </register>
    <register id="AESADV_GHASH_H2" width="32" offset="0x1118" description="CCM &amp; CBC-MAC second key  / GCM Hash Key input">
    </register>
    <register id="AESADV_GHASH_H3" width="32" offset="0x111C" description="CCM &amp; CBC-MAC second key (MSW) / GCM Hash Key input (MSW)">
    </register>
    <register id="AESADV_KEY0" width="32" offset="0x1120" description="KEY (LSW)">
    </register>
    <register id="AESADV_KEY1" width="32" offset="0x1124" description="KEY">
    </register>
    <register id="AESADV_KEY2" width="32" offset="0x1128" description="KEY">
    </register>
    <register id="AESADV_KEY3" width="32" offset="0x112C" description="KEY">
    </register>
    <register id="AESADV_KEY4" width="32" offset="0x1130" description="KEY">
    </register>
