dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/AESADV_1.0.xml
    <register id="AESADV_KEY5" width="32" offset="0x1134" description="KEY">
    </register>
    <register id="AESADV_KEY6" width="32" offset="0x1138" description="KEY">
    </register>
    <register id="AESADV_KEY7" width="32" offset="0x113C" description="KEY (MSW)">
    </register>
    <register id="AESADV_IV0" width="32" offset="0x1140" description="IV (LSW)">
    </register>
    <register id="AESADV_IV1" width="32" offset="0x1144" description="IV">
    </register>
    <register id="AESADV_IV2" width="32" offset="0x1148" description="IV">
    </register>
    <register id="AESADV_IV3" width="32" offset="0x114C" description="IV">
    </register>
    <register id="AESADV_CTRL" width="32" offset="0x1150" description="Input/Output Buffer Control and Mode selection">
        <bitfield id="OUTPUT_RDY" description="Output Ready. If 1b, this read-only status bit indicates that an AES output block is available for the CPU to retrieve." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NOTREADY" value="0x0" description="Not Ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="INPUT_RDY" description="Ready for input. If 1b, this read-only status bit indicates that the 16-byte input buffer is empty, and the CPU is permitted to write the next block of data. After reset, this bit is 0. After writing a context, this bit will become 1b." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NOTEMPTY" value="0x0" description="Not Ready"/>
            <bitenum id="EMPTY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="DIR" description="Direction. If set to 1b an encrypt operation is performed. If set to 0b a decrypt operation is performed. Note: This bit must be written with a 1b when CBC-MAC is selected." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DECRYPT" value="0x0" description="Decryption"/>
            <bitenum id="ENCRYPT" value="0x1" description="Encryption"/>
        </bitfield>
        <bitfield id="KEYSIZE" description="Specifies the encryption strength / key width" begin="4" end="3" width="2" rwaccess="R/W">
            <bitenum id="K128" value="0x1" description="128-bit key"/>
            <bitenum id="K256" value="0x3" description="256-bit key"/>
        </bitfield>
        <bitfield id="CBC" description="If set to 1b, cipher-block-chaining (CBC) mode is selected." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable CBC mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select CBC mode"/>
        </bitfield>
        <bitfield id="CTR" description="If set to 1b, AES counter mode (CTR) is selected. Note: This bit must also be set for GCM and CCM, when encryption/decryption is required." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable CBC mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select CBC mode"/>
        </bitfield>
        <bitfield id="CTR_WIDTH" description="When the CTR bit is set, specifies the counter width for AES-CTR mode.
When the CFB bit is set, specifies the CFB mode feedback width:" begin="8" end="7" width="2" rwaccess="R/W">
            <bitenum id="CTR32" value="0x0" description="32-bit counter"/>
            <bitenum id="CFB128" value="0x0" description="CFB-128 mode"/>
            <bitenum id="CTR64" value="0x1" description="64-bit counter"/>
            <bitenum id="CTR96" value="0x2" description="96-bit counter"/>
            <bitenum id="CTR128" value="0x3" description="128-bit counter"/>
        </bitfield>
        <bitfield id="ICM" description="When the CFB bit is set, specifies the CFB mode feedback width:" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable CBC mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select CBC mode"/>
        </bitfield>
        <bitfield id="CFB" description="If set to 1b, AES cipher feedback mode CFB is selected. Use the ctr_width field to specify the feedback width." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable CBC mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select CBC mode"/>
        </bitfield>
        <bitfield id="CBCMAC" description="If set to 1b, AES-CBC MAC is selected, the Direction bit must be set to 1 for this mode." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable CBC mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select CBC mode"/>
        </bitfield>
        <bitfield id="GCM" description="If not set to 00b, AES-GCM mode is selected, this is a combined mode, using the Galois field multiplier GF(2128) for authentication and AES-CTR mode for encryption, the bits specify the GCM mode: 01b = GHASH with H loaded and Y0-encrypted forced to zero 10b = GHASH with H loaded and Y0-encrypted calculated internally 11b = Autonomous GHASH (both H and Y0-encrypted calculated internally) Note: Besides GCM, the CTR mode bits must also be set to 1b to enable GCM with AES-CTR; if the CTR bit is not set a GHASH (authentication) only operation is performed. A GHASH only operation is only allowed if the GCM mode is set to '01b' and the direction bit is set to '0b'. Other modes may not be selected in combination with GCM. Table 14 below shows the valid combinations for the GCM and CTR mode bits, all other options are invalid and must not be selected." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="FORCE_ZERO" value="0x1" description="GHASH with H loaded and Y0-encrypted forced to 0."/>
            <bitenum id="LOAD_HASH_KEY" value="0x2" description="GHASH with H loaded and Y0-encrypted calculated internally"/>
            <bitenum id="AUTONOMOUS" value="0x3" description="Autonomous GHASH (both H and Y0-encrypted calculated internally)"/>
        </bitfield>
        <bitfield id="CCM" description="If set to 1b, AES-CCM is selected, this is a combined mode, using AES for both authentication and encryption. In addition to the CCM bit, the CTR mode bit must be set such that AES-CTR is enabled. Other combinations with CCM are invalid." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable CBC mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select CBC mode"/>
        </bitfield>
        <bitfield id="CCML" description="Defines L that indicates the width of the length field for CCM operations; the length field in bytes equals the value of CMM-L plus one. All values are supported." begin="21" end="19" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Length is 1"/>
            <bitenum id="MAXIMUM" value="0x7" description="Length is 8"/>
        </bitfield>
        <bitfield id="CCMM" description="Defines M that indicates the length of the authentication field for CCM operations; the authentication field length equals two times (the value of CCM-M plus one). Note: The EIP-39 always returns a 128-bit authentication field, of which the M least significant bytes are valid. All values are supported." begin="24" end="22" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Length is 1"/>
            <bitenum id="MAXIMUM" value="0x7" description="Length is 8"/>
        </bitfield>
        <bitfield id="OFB_GCM_CCM_CONT" description="This bit has a dual use, depending on the selection of CCM/GCM, see bits [18:16].
If CCM/GCM is not selected:
If this bit is set to 1b, full block AES output feedback mode (OFB-128) is selected.
If CCM/GCM is selected:
Continue processing of an interrupted AES-GCM or AES-CCM operation in the AAD phase.
Set this write-only signal to 1b together with the regular mode bit settings for a GCM or CCM operation, to continue processing from the next full AAD block (128 bits) boundary.
Before setting this bit all applicable context to resume processing must have been loaded into the engine: Keys, IV, intermediate digest/TAG, block counter and the CCM align data word (the latter is for CCM mode only). The mode can be written together with this bit, as it is part of the same register." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="OFB" value="0x1" description="Enable OFB"/>
            <bitenum id="GCM_CCM_CONTINUE" value="0x1" description="Continue GCM/CCM processing in AAD phase"/>
        </bitfield>
        <bitfield id="GET_DIGEST" description="Interrupt processing and generate an intermediate digest during an AES-GCM or AES-CCM operation.
Set this write-only signal to 1b to interrupt GCM or CCM processing at the next full block (128 bits) boundary. An intermediate digest may be requested during the encryption/decryption data phase or in the AAD phase.
Note: Interruption can only be done on full block (128 bits) boundaries. The minimum number of remaining bytes to resume and finalize the operation, must be greater than or equal to 1." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
        <bitfield id="GCM_CONT" description="Continue processing of an interrupted AES-GCM or AES-CCM operation in the crypto/payload phase.
Set this write-only signal to 1b together with the regular mode bit settings for a GCM or CCM operation, to continue processing from the next full block (128 bits) boundary.
Before setting this bit all applicable context to resume processing must have been loaded into the engine: Keys, IV, intermediate digest/TAG and block counter. The mode can be written together with this bit, as it is part of the same register." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
        <bitfield id="SAVE_CNTXT" description="This bit is used to indicate that an authentication TAG or result IV needs to be stored as a result context. If this bit is set, context output DMA and/or interrupt will be asserted if the operation is finished, and related signals are enabled.
Typically, this value must be set for authentication modes returning a TAG (CBC-MAC, GCM and CCM), or for basic encryption modes that require future continuation with the current result IV.
If this bit is set, the engine will hold its full context until the TAG and/or IV registers are read. Only after reading the TAG or IV, a new DMA request for a new (input) context will be asserted.
If this bit is not set, the engine will assert the context input DMA request signal directly after starting to process the last block with the current context." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
        <bitfield id="SAVED_CNTXT_RDY" description="If 1b, this read-only status bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the Host to retrieve. This bit is only asserted if the save_context bit is set to 1b. The bit is mutually exclusive with the context_ready bit." begin="30" end="30" width="1" rwaccess="R">
            <bitenum id="NOTREADY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="CNTXT_RDY" description="If 1b, this read-only status bit indicates that the context data registers can be overwritten, and the CPU is permitted to write the next context." begin="31" end="31" width="1" rwaccess="R">
            <bitenum id="NOTREADY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
    </register>
    <register id="AESADV_C_LENGTH_0" width="32" offset="0x1154" description="Crypto data length (LSW)">
    </register>
